{
  "interview_questions": {
    "technical": {
      "software_engineering": [
        "What is the difference between a stack and a queue?",
        "Explain the concept of Object-Oriented Programming.",
        "What are the four pillars of OOP?",
        "What is the difference between a class and an object?",
        "Explain what a constructor is.",
        "What is inheritance in programming?",
        "What is polymorphism?",
        "What is encapsulation?",
        "What is abstraction?",
        "Explain the difference between overloading and overriding.",
        "Explain the SOLID principles in software design.",
        "What are design patterns? Give examples.",
        "Explain the difference between composition and inheritance.",
        "What is dependency injection?",
        "What are the differences between REST and SOAP APIs?",
        "Explain microservices architecture.",
        "What is the difference between synchronous and asynchronous programming?",
        "What are race conditions and how do you prevent them?",
        "Explain the concept of load balancing.",
        "What is the difference between horizontal and vertical scaling?",
        "Design a distributed system for a social media platform.",
        "How would you implement a rate limiter?",
        "Explain CAP theorem and its implications.",
        "Design a URL shortener like bit.ly.",
        "How would you handle database sharding?",
        "Explain eventual consistency in distributed systems.",
        "Design a chat application that can handle millions of users.",
        "How would you implement a distributed cache?",
        "Explain the trade-offs between different database types.",
        "Design a notification system for a mobile app."
      ],
      "data_structures_algorithms": [
        "What is Big O notation?",
        "Explain the difference between arrays and linked lists.",
        "What is a binary tree?",
        "Explain linear search vs binary search.",
        "What is recursion?",
        "What are the basic sorting algorithms?",
        "Explain the concept of a hash table.",
        "What is a graph data structure?",
        "What is the difference between DFS and BFS?",
        "Explain what a priority queue is.",
        "Implement a binary search tree.",
        "Find the lowest common ancestor of two nodes in a binary tree.",
        "Implement a LRU cache.",
        "Find the cycle in a linked list.",
        "Implement merge sort and explain its time complexity.",
        "What is dynamic programming? Give an example.",
        "Implement Dijkstra's algorithm.",
        "Find the median of two sorted arrays.",
        "Implement a trie data structure.",
        "Solve the coin change problem using dynamic programming.",
        "Design and implement a B-tree.",
        "Implement a segment tree for range queries.",
        "Solve the traveling salesman problem.",
        "Implement a suffix array and use it for pattern matching.",
        "Design an efficient algorithm for finding strongly connected components.",
        "Implement a persistent data structure.",
        "Solve the maximum flow problem using Ford-Fulkerson algorithm.",
        "Design an algorithm for finding the shortest path in a graph with negative edges.",
        "Implement a balanced binary search tree (AVL or Red-Black).",
        "Design an efficient algorithm for online median calculation."
      ],
      "database_systems": [
        "What is a database?",
        "Explain the difference between SQL and NoSQL databases.",
        "What is a primary key?",
        "What is a foreign key?",
        "Explain the concept of normalization.",
        "What are the different types of SQL joins?",
        "What is an index in a database?",
        "Explain ACID properties.",
        "What is the difference between DELETE and TRUNCATE?",
        "What is a stored procedure?",
        "Explain database normalization forms (1NF, 2NF, 3NF).",
        "What is a database transaction?",
        "Explain different isolation levels in databases.",
        "What is the difference between clustered and non-clustered indexes?",
        "Explain query optimization techniques.",
        "What is database replication?",
        "Explain the difference between OLTP and OLAP.",
        "What is a database trigger?",
        "Explain the concept of database partitioning.",
        "What is a materialized view?",
        "Design a database schema for an e-commerce platform.",
        "Explain distributed database concepts.",
        "How would you handle database migrations in a production environment?",
        "Design a database backup and recovery strategy.",
        "Explain database sharding strategies.",
        "How would you optimize a slow-performing query?",
        "Design a multi-tenant database architecture.",
        "Explain the internals of a database engine.",
        "How would you implement database connection pooling?",
        "Design a data warehouse architecture."
      ],
      "web_development": {
        "frontend": [
          "What is the difference between HTML, CSS, and JavaScript?",
          "Explain the DOM and how to manipulate it.",
          "What are closures in JavaScript?",
          "Explain event bubbling and event capturing.",
          "What is the difference between let, const, and var?",
          "Explain promises and async/await in JavaScript.",
          "What is the virtual DOM in React?",
          "Explain the component lifecycle in React.",
          "What are hooks in React?",
          "Explain responsive web design principles.",
          "What is the difference between localStorage and sessionStorage?",
          "Explain CSS Grid vs Flexbox.",
          "What is Cross-Origin Resource Sharing (CORS)?",
          "Explain webpack and its purpose.",
          "What are Progressive Web Apps (PWAs)?"
        ],
        "backend": [
          "Explain the MVC architecture pattern.",
          "What is middleware in web frameworks?",
          "Explain authentication vs authorization.",
          "What is JWT and how does it work?",
          "Explain different HTTP status codes.",
          "What is the difference between cookies and sessions?",
          "Explain RESTful API design principles.",
          "What is GraphQL and how does it differ from REST?",
          "Explain server-side rendering vs client-side rendering.",
          "What is containerization with Docker?",
          "Explain different caching strategies.",
          "What is API versioning?",
          "Explain the concept of webhooks.",
          "What is the difference between SQL injection and XSS?",
          "Explain load balancing techniques."
        ]
      },
      "mobile_development": {
        "android": [
          "What is an Activity in Android?",
          "Explain the Android application lifecycle.",
          "What is the difference between Intent and IntentFilter?",
          "Explain different types of Android layouts.",
          "What is a Fragment in Android?",
          "Explain the difference between AsyncTask and Thread.",
          "What is the Android Manifest file?",
          "Explain different storage options in Android.",
          "What is the difference between Serializable and Parcelable?",
          "Explain Android permissions model."
        ],
        "ios": [
          "What is the difference between Swift and Objective-C?",
          "Explain the iOS application lifecycle.",
          "What are optionals in Swift?",
          "Explain delegation pattern in iOS.",
          "What is the difference between strong and weak references?",
          "Explain MVC vs MVVM patterns in iOS.",
          "What is Core Data in iOS?",
          "Explain the difference between push and modal segues.",
          "What is Grand Central Dispatch (GCD)?",
          "Explain iOS memory management."
        ],
        "cross_platform": [
          "Compare React Native vs Flutter.",
          "Explain the architecture of React Native.",
          "What are the advantages of cross-platform development?",
          "Explain hot reload in Flutter.",
          "What is the difference between widgets and components?",
          "Explain state management in Flutter.",
          "What are the performance considerations in cross-platform apps?",
          "Explain native modules in React Native.",
          "What is the difference between hybrid and native apps?",
          "Explain the build process for cross-platform apps."
        ]
      },
      "machine_learning": [
        "What is machine learning?",
        "Explain supervised vs unsupervised learning.",
        "What is the difference between classification and regression?",
        "What is overfitting and how do you prevent it?",
        "Explain the bias-variance tradeoff.",
        "What is cross-validation?",
        "Explain the difference between training and testing data.",
        "What is feature engineering?",
        "What is the curse of dimensionality?",
        "Explain different evaluation metrics for classification.",
        "Explain different types of neural networks.",
        "What is backpropagation?",
        "Explain gradient descent and its variants.",
        "What is regularization in machine learning?",
        "Explain ensemble methods like Random Forest.",
        "What is the difference between bagging and boosting?",
        "Explain dimensionality reduction techniques.",
        "What is transfer learning?",
        "Explain different clustering algorithms.",
        "What is reinforcement learning?",
        "Design a recommendation system for an e-commerce platform.",
        "Explain the architecture of a transformer model.",
        "How would you handle class imbalance in a dataset?",
        "Design a machine learning pipeline for production.",
        "Explain distributed training of neural networks.",
        "How would you deploy a machine learning model at scale?",
        "Explain the challenges of machine learning in production.",
        "Design a real-time fraud detection system.",
        "How would you handle concept drift in machine learning?",
        "Explain federated learning and its applications."
      ],
      "cybersecurity": [
        "What is cybersecurity?",
        "Explain different types of cyber attacks.",
        "What is encryption and decryption?",
        "What is the difference between symmetric and asymmetric encryption?",
        "Explain authentication and authorization.",
        "What is a firewall?",
        "What is malware?",
        "Explain the concept of social engineering.",
        "What is a VPN?",
        "What is the difference between vulnerability and threat?",
        "Explain the CIA triad in cybersecurity.",
        "What is penetration testing?",
        "Explain different types of cryptographic algorithms.",
        "What is digital signature?",
        "Explain the concept of zero-day exploits.",
        "What is intrusion detection system (IDS)?",
        "Explain the difference between blacklist and whitelist.",
        "What is multi-factor authentication?",
        "Explain the concept of defense in depth.",
        "What is incident response in cybersecurity?",
        "Design a secure architecture for a financial application.",
        "Explain advanced persistent threats (APTs).",
        "How would you implement a security operations center (SOC)?",
        "Design a comprehensive incident response plan.",
        "Explain the challenges of securing cloud environments.",
        "How would you conduct a security audit?",
        "Design a zero-trust security model.",
        "Explain the concept of threat intelligence.",
        "How would you secure a microservices architecture?",
        "Design a comprehensive data protection strategy."
      ],
      "cloud_computing": [
        "What is cloud computing?",
        "Explain the difference between IaaS, PaaS, and SaaS.",
        "What are the advantages of cloud computing?",
        "Explain public, private, and hybrid clouds.",
        "What is virtualization?",
        "What is auto-scaling?",
        "Explain the concept of elasticity in cloud computing.",
        "What is a CDN?",
        "What is the difference between horizontal and vertical scaling?",
        "Explain the shared responsibility model in cloud security.",
        "Explain different cloud service models.",
        "What is containerization and orchestration?",
        "Explain the concept of serverless computing.",
        "What is infrastructure as code?",
        "Explain different cloud storage types.",
        "What is cloud migration?",
        "Explain the concept of multi-cloud strategy.",
        "What is cloud monitoring and logging?",
        "Explain cloud networking concepts.",
        "What is disaster recovery in cloud computing?",
        "Design a highly available architecture on AWS/Azure/GCP.",
        "Explain cloud cost optimization strategies.",
        "How would you implement a cloud-native application?",
        "Design a disaster recovery plan for cloud infrastructure.",
        "Explain the challenges of cloud governance.",
        "How would you implement cloud security best practices?",
        "Design a multi-region deployment strategy.",
        "Explain the concept of cloud-native security.",
        "How would you handle cloud vendor lock-in?",
        "Design a comprehensive cloud monitoring strategy."
      ],
      "devops": [
        "What is DevOps?",
        "Explain the DevOps lifecycle.",
        "What is continuous integration (CI)?",
        "What is continuous deployment (CD)?",
        "Explain the difference between CI and CD.",
        "What is version control?",
        "What is the difference between Git and GitHub?",
        "What is a build pipeline?",
        "Explain the concept of infrastructure as code.",
        "What is monitoring in DevOps?",
        "Explain different deployment strategies.",
        "What is the difference between blue-green and canary deployment?",
        "Explain containerization with Docker.",
        "What is Kubernetes?",
        "Explain configuration management tools.",
        "What is the difference between push and pull-based CI/CD?",
        "Explain the concept of GitOps.",
        "What is infrastructure monitoring?",
        "Explain the concept of observability.",
        "What is the difference between logging and monitoring?",
        "Design a complete CI/CD pipeline for a microservices application.",
        "Explain advanced Kubernetes concepts like operators and CRDs.",
        "How would you implement zero-downtime deployments?",
        "Design a comprehensive monitoring and alerting strategy.",
        "Explain the concept of chaos engineering.",
        "How would you implement security in DevOps (DevSecOps)?",
        "Design a multi-environment deployment strategy.",
        "Explain the challenges of managing microservices in production.",
        "How would you implement automated testing in CI/CD?",
        "Design a comprehensive backup and recovery strategy."
      ]
    },
    "behavioral": {
      "teamwork_collaboration": [
        "Tell me about a time when you worked well with a team member.",
        "Describe a situation where you helped someone complete their work.",
        "Give me an example of when you had to cooperate with others to achieve a goal.",
        "Tell me about a time when you had to work with someone you didn't know well.",
        "Describe a time when you had to collaborate with a difficult team member.",
        "Tell me about a time when you had to resolve conflicts within your team.",
        "Give an example of when you had to build consensus among team members.",
        "Describe a situation where you had to work with multiple teams simultaneously.",
        "Tell me about a time when you had to unite a divided team.",
        "Describe a situation where you had to collaborate with executives on a project.",
        "Give an example of leading cross-functional collaboration on a high-stakes project.",
        "Describe a time when you had to maintain team morale during difficult circumstances."
      ],
      "communication": [
        "Describe a time when you had to explain something clearly to someone.",
        "Tell me about a time when you had to ask for help.",
        "Give me an example of when you had to give someone instructions.",
        "Describe a situation where you had to listen carefully to understand someone's needs.",
        "Tell me about a time when you had to communicate bad news to your team.",
        "Describe a situation where you had to adapt your communication style for different audiences.",
        "Give an example of when you had to facilitate a difficult conversation.",
        "Describe a time when you had to present complex information simply.",
        "Tell me about a time when you had to communicate a major organizational change.",
        "Describe a situation where you mediated communication between conflicting parties.",
        "Give an example of when you had to craft a message for multiple stakeholder groups.",
        "Describe a time when your communication skills prevented a crisis."
      ],
      "problem_solving": [
        "Tell me about a problem you solved recently.",
        "Describe a time when you found a better way to do something.",
        "Give me an example of when you had to figure something out on your own.",
        "Tell me about a time when you had to research information to solve a problem.",
        "Describe a complex problem you solved that required multiple steps.",
        "Tell me about a time when you had to solve a problem with limited resources.",
        "Give me an example of when you had to analyze data to make a decision.",
        "Describe a situation where you had to solve a problem that affected multiple departments.",
        "Tell me about a time when you had to solve an ambiguous problem with no clear solution.",
        "Describe a situation where you identified and solved a problem before it occurred.",
        "Give an example of solving a systemic organizational problem.",
        "Describe a time when you solved a problem that had significant financial implications."
      ]
    },
    "hr_general": {
      "basic_background": [
        "Tell me about yourself.",
        "Why are you interested in this position?",
        "What do you know about our company?",
        "What attracted you to this field?",
        "Describe your educational background.",
        "How does your background prepare you for this role?",
        "What specific experiences make you qualified for this position?",
        "How have your previous roles led you to this career point?",
        "What professional achievements are you most proud of.",
        "How does your unique background give you perspective for this executive role?",
        "What formative experiences shaped your professional philosophy?",
        "How have you reinvented yourself professionally?",
        "What career transitions have prepared you for this challenge?"
      ],
      "motivation_goals": [
        "What motivates you to do your best work?",
        "Where do you see yourself in 2-3 years?",
        "What type of work environment do you prefer?",
        "What are you looking for in your next role?",
        "How do you define success?",
        "How do your personal values align with this company's mission?",
        "What professional goals are you currently working toward?",
        "How does this role fit into your long-term career plan?",
        "What would make this position truly fulfilling for you?",
        "What vision do you have for your professional legacy?",
        "How do you balance organizational goals with personal growth?",
        "What leadership philosophy guides your career decisions?",
        "How do you measure meaningful professional impact?"
      ]
    }
  },
  "question_metadata": {
    "total_questions": 450,
    "categories": {
      "technical": 315,
      "behavioral": 90,
      "hr_general": 45
    },
    "fields_covered": [
      "Software Engineering",
      "Data Structures & Algorithms",
      "Database Systems",
      "Web Development",
      "Mobile Development",
      "Machine Learning",
      "Cybersecurity",
      "Cloud Computing",
      "DevOps",
      "Behavioral Skills",
      "HR & General"
    ]
  }
}